%----------牛顿向前插值---------
clc;
clear;
X=[1 1.05 1.10 1.15 1.20 1.25 1.30];
Y=[1 1.02470 1.04881 1.07238 1.09544 1.11803 1.14017];
x=1.01;   %要求该点的牛顿向前插值
h=X(2)-X(1);    %步长h
t=(x-X(1))/h;    
n = length(X);    
A = zeros(n,n);

A(1:n,1) = Y(1:n);  %给向前差分表的第一列赋初值
for j=2:n
    for i =1:n-j+1
        A(i,j) = A(i+1,j-1)-A(i,j-1);   %构造向前差分表(矩阵)
        N(j) = A(1,j);   %取所需要的差分值
    end
end

for k =2:n
    N(k-1) =N(k);  %这里是为了方便后面使用对差分值相应位置前移一位
end

g=1;
sum =Y(1);
for i =1:n
     g = g*(t-i+1);  %g代表t(t-1)(t-2)...(t-n-1)
     f = factorial(i);   %f表示阶乘  
     sum = sum+ (g/f)*N(i); %牛顿向前插值公式
end
fprintf('该点牛顿向前插值之后值为：')
sum