%------------（复合）Simpson积分-----------
clc;clear;
x0 = 0;   %积分下限
x1 = 1;  %积分上限
n = 100;  %划分，与梯形积分公式相比，可以发现Simpson公式划分的区间可以少一半但结果确相同
h = (x1-x0)/n;  %区间长度
syms x;
f(x) = sin(x);   %被积函数
s = 0;  %s代表面积求和
for i = x0:h:x1-h   %从x0开始计算n个区间只需要到x1-h即可，若到x1则会多计算一个区间
    f0 = f(x0);
    x1 = x0+h;
    f1 = f(x1);
    x2 = (x0+x1)/2;
    f2 = f(x2);
    s = s + h/6*(f0+4*f2+f1);  %Simpson求积公式
    x0 = x1;
end

fprintf('积分的结果为：')
u0 = vpa(s,5)   %精确到小数点后五位

%--------MATLAB系统提供的积分公式------
x0 = 0;   %积分下限
x1 = 1;  %积分上限
fprintf('系统的积分公式的积分结果为：')
u1 = vpa(int(sin(x),x0,x1),5)